#include <stdio.h>

float a = 0.617;
float b = 25;
float c = 19;
float d = 9;
float e = 124.555;
float f = 0.001;

int main() {
printf("a=%6.3f%%\n",a); // ช่องกว้าง 6 ทศนิยม 3 ตำเเหน่ง ชิดขวา
printf("b=%4.0f%%\n",b); // ช่องกว้าง 4 ชิดขวา
printf("c=%6.3f%%\n",c); // ช่องกว้าง 6 ทศนิยม 3 ตำเเหน่ง ชิดขวา
printf("d=%-2.0f%%\n",d); // ช่องกว้าง 2 ชิดซ้าย
printf("e=%7.3f%%\n",e); // ช่องกว้าง 7 ทศนิยม 3 ตำเเหน่ง ชิดขวา
printf("f=%5.3f%%\n",f); // ช่องกว้าง 5 ทศนิยม 3 ตำเเหน่ง ชิดขวา

return 0; // คืนค่า 0 เพื่อบ่งชี้ว่าการทำงานสำเร็จ
}